ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=32, out_features=8, bias=True)
  (5): Linear(in_features=32, out_features=8, bias=True)
  (6): Linear(in_features=32, out_features=8, bias=True)
  (7): Linear(in_features=32, out_features=8, bias=True)
  (8): Linear(in_features=32, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=32, out_features=8, bias=True)
  (5): Linear(in_features=32, out_features=8, bias=True)
  (6): Linear(in_features=32, out_features=8, bias=True)
  (7): Linear(in_features=32, out_features=8, bias=True)
  (8): Linear(in_features=32, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=32, out_features=8, bias=True)
  (5): Linear(in_features=32, out_features=8, bias=True)
  (6): Linear(in_features=32, out_features=8, bias=True)
  (7): Linear(in_features=32, out_features=8, bias=True)
  (8): Linear(in_features=32, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=32, out_features=8, bias=True)
  (5): Linear(in_features=32, out_features=8, bias=True)
  (6): Linear(in_features=32, out_features=8, bias=True)
  (7): Linear(in_features=32, out_features=8, bias=True)
  (8): Linear(in_features=32, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=32, out_features=8, bias=True)
  (5): Linear(in_features=32, out_features=8, bias=True)
  (6): Linear(in_features=32, out_features=8, bias=True)
  (7): Linear(in_features=32, out_features=8, bias=True)
  (8): Linear(in_features=32, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=27, out_features=8, bias=True)
  (5): Linear(in_features=27, out_features=8, bias=True)
  (6): Linear(in_features=27, out_features=8, bias=True)
  (7): Linear(in_features=27, out_features=8, bias=True)
  (8): Linear(in_features=27, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=27, out_features=8, bias=True)
  (5): Linear(in_features=27, out_features=8, bias=True)
  (6): Linear(in_features=27, out_features=8, bias=True)
  (7): Linear(in_features=27, out_features=8, bias=True)
  (8): Linear(in_features=27, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=27, out_features=8, bias=True)
  (5): Linear(in_features=27, out_features=8, bias=True)
  (6): Linear(in_features=27, out_features=8, bias=True)
  (7): Linear(in_features=27, out_features=8, bias=True)
  (8): Linear(in_features=27, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=27, out_features=8, bias=True)
  (5): Linear(in_features=27, out_features=8, bias=True)
  (6): Linear(in_features=27, out_features=8, bias=True)
  (7): Linear(in_features=27, out_features=8, bias=True)
  (8): Linear(in_features=27, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=27, out_features=8, bias=True)
  (5): Linear(in_features=27, out_features=8, bias=True)
  (6): Linear(in_features=27, out_features=8, bias=True)
  (7): Linear(in_features=27, out_features=8, bias=True)
  (8): Linear(in_features=27, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=23, out_features=8, bias=True)
  (4): Linear(in_features=23, out_features=8, bias=True)
  (5): Linear(in_features=23, out_features=8, bias=True)
  (6): Linear(in_features=23, out_features=8, bias=True)
  (7): Linear(in_features=23, out_features=8, bias=True)
  (8): Linear(in_features=23, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=23, out_features=8, bias=True)
  (4): Linear(in_features=23, out_features=8, bias=True)
  (5): Linear(in_features=23, out_features=8, bias=True)
  (6): Linear(in_features=23, out_features=8, bias=True)
  (7): Linear(in_features=23, out_features=8, bias=True)
  (8): Linear(in_features=23, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=23, out_features=8, bias=True)
  (4): Linear(in_features=23, out_features=8, bias=True)
  (5): Linear(in_features=23, out_features=8, bias=True)
  (6): Linear(in_features=23, out_features=8, bias=True)
  (7): Linear(in_features=23, out_features=8, bias=True)
  (8): Linear(in_features=23, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=23, out_features=8, bias=True)
  (4): Linear(in_features=23, out_features=8, bias=True)
  (5): Linear(in_features=23, out_features=8, bias=True)
  (6): Linear(in_features=23, out_features=8, bias=True)
  (7): Linear(in_features=23, out_features=8, bias=True)
  (8): Linear(in_features=23, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=23, out_features=8, bias=True)
  (4): Linear(in_features=23, out_features=8, bias=True)
  (5): Linear(in_features=23, out_features=8, bias=True)
  (6): Linear(in_features=23, out_features=8, bias=True)
  (7): Linear(in_features=23, out_features=8, bias=True)
  (8): Linear(in_features=23, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=18, out_features=8, bias=True)
  (4): Linear(in_features=18, out_features=8, bias=True)
  (5): Linear(in_features=18, out_features=8, bias=True)
  (6): Linear(in_features=18, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=18, out_features=8, bias=True)
  (4): Linear(in_features=18, out_features=8, bias=True)
  (5): Linear(in_features=18, out_features=8, bias=True)
  (6): Linear(in_features=18, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=18, out_features=8, bias=True)
  (4): Linear(in_features=18, out_features=8, bias=True)
  (5): Linear(in_features=18, out_features=8, bias=True)
  (6): Linear(in_features=18, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=18, out_features=8, bias=True)
  (4): Linear(in_features=18, out_features=8, bias=True)
  (5): Linear(in_features=18, out_features=8, bias=True)
  (6): Linear(in_features=18, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=18, out_features=8, bias=True)
  (4): Linear(in_features=18, out_features=8, bias=True)
  (5): Linear(in_features=18, out_features=8, bias=True)
  (6): Linear(in_features=18, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=8, bias=True)
  (6): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=8, bias=True)
  (6): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=8, bias=True)
  (6): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=8, bias=True)
  (6): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=8, bias=True)
  (6): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=28, out_features=8, bias=True)
  (5): Linear(in_features=28, out_features=8, bias=True)
  (6): Linear(in_features=28, out_features=8, bias=True)
  (7): Linear(in_features=28, out_features=8, bias=True)
  (8): Linear(in_features=28, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=17, out_features=8, bias=True)
  (4): Linear(in_features=17, out_features=8, bias=True)
  (5): Linear(in_features=17, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=14, out_features=8, bias=True)
  (3): Linear(in_features=14, out_features=8, bias=True)
  (4): Linear(in_features=14, out_features=8, bias=True)
  (5): Linear(in_features=14, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=14, out_features=8, bias=True)
  (3): Linear(in_features=14, out_features=8, bias=True)
  (4): Linear(in_features=14, out_features=8, bias=True)
  (5): Linear(in_features=14, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=14, out_features=8, bias=True)
  (3): Linear(in_features=14, out_features=8, bias=True)
  (4): Linear(in_features=14, out_features=8, bias=True)
  (5): Linear(in_features=14, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=14, out_features=8, bias=True)
  (3): Linear(in_features=14, out_features=8, bias=True)
  (4): Linear(in_features=14, out_features=8, bias=True)
  (5): Linear(in_features=14, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=14, out_features=8, bias=True)
  (3): Linear(in_features=14, out_features=8, bias=True)
  (4): Linear(in_features=14, out_features=8, bias=True)
  (5): Linear(in_features=14, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=21, out_features=8, bias=True)
  (4): Linear(in_features=21, out_features=8, bias=True)
  (5): Linear(in_features=21, out_features=8, bias=True)
  (6): Linear(in_features=21, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=24, out_features=8, bias=True)
  (5): Linear(in_features=24, out_features=8, bias=True)
  (6): Linear(in_features=24, out_features=8, bias=True)
  (7): Linear(in_features=24, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=24, out_features=8, bias=True)
  (5): Linear(in_features=24, out_features=8, bias=True)
  (6): Linear(in_features=24, out_features=8, bias=True)
  (7): Linear(in_features=24, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=24, out_features=8, bias=True)
  (5): Linear(in_features=24, out_features=8, bias=True)
  (6): Linear(in_features=24, out_features=8, bias=True)
  (7): Linear(in_features=24, out_features=2, bias=True)
)
ModuleList(
  (0): Linear(in_features=2, out_features=8, bias=True)
  (1): Linear(in_features=8, out_features=8, bias=True)
  (2): Linear(in_features=16, out_features=8, bias=True)
  (3): Linear(in_features=24, out_features=8, bias=True)
  (4): Linear(in_features=24, out_features=8, bias=True)
  (5): Linear(in_features=24, out_features=8, bias=True)
  (6): Linear(in_features=24, out_features=8, bias=True)
  (7): Linear(in_features=24, out_features=2, bias=True)
)
